# Chapter 20.Develop a Sense of Urgency
#
# Chapter 21.Single Handle Every Task

def develop_a_sense_of_urgency():
    insight = """
    Спосіб 20: Розвиньте відчуття крайньої необхідності
    
    Розвиньте відчуття крайньої необхідності.
    Перебування в стані куражу є найвищим станом продуктивності людини.
    Розвивайте відчуття крайньої необхідності – біжіть наввипередки з самим собою.
    Хоча для перемоги над інерцією і початку руху необхідна надзвичайно велика кількість енергії, 
    продовження руху потребує її набагато менше.
    Ніщо так не допоможе вам у кар’єрі, як репутація людини, котра важливу роботу виконує швидко й добре.
    """
    print(insight)


def single_handle_every_task():
    insight = """
    Спосіб 21: Виконуйте завдання по одному
    
    Виконуйте завдання по одному
    Зосереджуючись на єдиному, найважливішому завданні, ви можете на 50 % скоротити час,
    потрібний на його виконання.
    Будь-яка інша діяльність не така важлива й потрібна, як обране пріоритетне завдання.
    Починаючи виконувати пріоритетне завдання і продовжуйте роботу над ним,
    доки воно не буде завершене на 100 %.
    """
    print(insight)


def shares_his_insight():
    print('Євген Ш.:')
    develop_a_sense_of_urgency()

    single_handle_every_task()
