# Chapter 6.Use the ABCDE Method Continually
#
# Chapter 7.Focus on Key Result Areas
def use_the_abcde_method_continually():
    insight = """
    Спосіб 6: Постійно використовуйте метод АБВГД
    
    Метод АБВГД – це потужна техніка встановлення пріоритетів, яку можна використовувати щодня
    Думайте на папері. Перед початком роботи розставте А, Б, В, Г, Д перед кожним пунктом.
    Літерою А позначайте щось дуже важливе, те, що ви повинні обов’язково зробити. 
    Літерою Б позначте завдання, які вам слід виконати. 
    Завдання В – це те, що зробити було б добре, але жодних наслідків від невиконання цього пункту не буде.
    Літерою Г позначте те, що можна доручити комусь іншому. 
    Під літерою Д ховаються завдання, які можна прибрати, бо вони не несуть ніякого значення.
    """
    print(insight)


def focus_on_key_result_areas():
    insight = """
    Спосіб 7: Зосередьтесь на сферах ключових результатів
    
    Сфера ключового результату – це те, за що ви повністю несете відповідальність.
    Якщо ви цього не робите, то воно не робиться взагалі. Сфера ключового результату 
    перебуває під вашим цілковитим контролем.
    Сфери ключових результатів дуже подібні до життєво важливих функцій тіла, 
    як-от кров’яний тиск, серцебиття, дихання, мозкова діяльність.
    Правило: ваша найслабша сфера ключових результатів ставить висоту, 
    на якій ви можете використовувати всі свої вміння та навички.
    Припиніть раціоналізувати, оцінювати й захищати свої слабкості, натомість чітко їх окресліть. 
    Поставте собі мету і побудуйте план, щоб стати насправді добрим фахівцем у кожній із цих сфер.
    Один із найшвидших і найкращих способів припинити прокрастинацію та навчитися скоріше виконувати роботу – 
    стати абсолютним експертом у своїх ключових сферах.
    """
    print(insight)


def shares_his_insight():
    print('Сергій: ')
    use_the_abcde_method_continually()

    focus_on_key_result_areas()
