# Chapter 4.Consider the Consequences
#
# Chapter 5.Practice Creative Procrastination

def consider_the_consequences():
    insight = """
    Спосіб 4: Думайте про наслідки
    
    Необхідно вміти передбачати наслідки виконання або невиконання чогось
    Вміння бачити далеку перспективу визначає твій успіх у житті.
    Мислення про далеку перспективу покращує прийняття рішень на близьку перспективу.
    Необхідно мати чітку орієнтацію на майбутнє. Міркувати на п'ять, десять або двадцять років наперед.
    Починаючи роботу запитуй себе: "Що буде якщо я зроблю це або не зроблю?"
    Набагато легше прийняти більш зважене рішення зараз, якщо маєш чітке уявлення, що важливе в майбутньому.
    Бути успішним значить йти на жертви зараз, щоб отримати з відсотками в майбутньому.
    Мотивація потребує мотиву. Справа повинна приносити задоволення.
    Роби тільки ті справи, що здатні змінити щось в твоєму майбутньому або майбутньому вашої компанії.
    Час минає так чи інакше, питання - де ви опинитесь після певного періоду часу.
    Постійні думки про потенційні наслідки - найліпший спосіб визначити, що саме є головним в особистому житті та в роботі.
    Ніколи не буде досить часу, щоб виконати все. Та це й не треба.
    Краще ретельно спланувати час наперед ніж робити все в останню хвилину.
    Додай ще 20% запасу по часу до свого плану.
    Запитуй постійно себе: "Які дії мають для мене найвищу цінність?"
    Запитуй постійно себе: "Що такого можу зробити я і ніхто, окрім мене, що дійсно матиме велике значення?"
    Запитуй постійно себе: " Як найкраще використати свій час саме зараз?"
    Запитуй себе знов і знов.
    Регулярно переглядай перелік своїх справ та визначай найважливіше.
    """
    print(insight)


def practice_creative_procrastination():
    insight = """
    Спосіб 5: Займайтесь творчою прокрастинацією
    
    Щодня знаходь час для виконання найбільших завдань.
    Зволікати з виконанням завдань усе одно доведеться, тому зволікати треба з завданнями, 
    що мають низьку цінність.
    Кажи "Ні" всьому, що немає великої цінності для тебе, бо зайвого часу в тебе немає.
    Не зволікай з виконанням великих та важливих завдань та навпаки зволікай з другорядними завданнями.
    Постійно переглядай своє життя й роботу та визначай другорядні речі всюди, де тільки можна.
    Практика "Нульового мислення", якщо я б не почав робити щось знаючи на самому початку, що це таке - 
    це прямий кандидат на уникнення чи творчу прокрастинацію.
    Обери один вид діяльності який вже сьогодні можна уникнути.
    """
    print(insight)


def shares_his_insight():
    print('Віталій: ')
    consider_the_consequences()

    practice_creative_procrastination()
