# Chapter 14.Put the Pressure on Yourself
#
# Chapter 15.Maximize Your Personal Power

def put_the_pressure_on_yourself():
    insight = """
    Спосіб 14: Тисніть на себе
    
    необхідною річчю для успіху є постійне й невтомне спрямування фізичної 
    та розумової енергії на розв’язання однієї проблеми.

    У світі повно людей, які чекають, що хтось прийде й мотивує їх нарешті стати тими,
    якими вони хотіли б бути. Але проблема в тому, що ніхто не прийде.
    
    Максимізуйте свої особисті сили
    Створювання уявних дедлайнів це найкращий спосіб перемогти прокрастинацію - 
    працювати так, наче на виконання найважливішої роботи маєте лише один день.
    Ставте собі дедлайни та проміжні дедлайни для кожного завдання й діяльності.
    Записуйте кожен крок великої роботи чи проекту перед тим, як почати. 

    """
    print(insight)


def maximize_your_personal_power():
    insight = """
    Спосіб 15: Максимізуйте свої особисті сили
    
    Зберіть свої ресурси, об'єднайте свої таланти, сконцентруйте енергію,
    спрямуйте свої можливості на майстерність оволодіння принаймні однією
    сферою власних прагнень.
    
    Коли ви перепрацьовуєте, то не викладаєтесь на повну. Працюйте у своєму
    темпі. Спіть достатньо. Дбайте про своє фізичне здоров'я.
    
    Сировина особистої роботи й продуктивності міститься у нашій фізичній,
    розумовій та емоційній енергії. Наше тіло схоже на машину, що використовує їжу,
    воду та відпочинок і генерує енергію, яку ми потім кидаємо не виконання 
    важливиї завдань у житті й роботі. 
    
    """
    print(insight)


def shares_her_insight():
    print('Владилена: ')
    put_the_pressure_on_yourself()

    maximize_your_personal_power()
